app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order("created_at DESC")

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello"], ["content", "wow!"], ["created_at", "2019-08-14 13:48:52.100272"], ["updated_at", "2019-08-14 13:48:52.100272"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "vdffb f f bd fveve\r\n"], ["updated_at", "2019-08-14 18:39:16.318547"], ["id", 6]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)